docs/Bytecode.org
:PROPERTIES:
:header-args: :tangle ../elisp/scripts/extract-bytecode.el
:END:
#+title: Extracting Emacs Bytecode

#+begin_quote
[[https://github.com/oracle/graal/blob/master/truffle/README.md][Truffle]] provides a [[https://github.com/oracle/graal/blob/master/truffle/docs/bytecode_dsl/BytecodeDSL.md][Bytecode DSL]] now. Since the DSL supports "boxing elimination,
quickening, and more", converting from Emacs bytecode to the DSL seems worth it.

However, this DSL assumes a prefix notation (Polish notation), while Emacs
bytecode uses postfix notation (Reverse Polish). To convert between the two, we
need know the precise stack effects of each opcode, which this file tries to
extract.
#+end_quote

No, it will not work and we cannot convert from Emacs bytecode to Truffle DSL:
1. Truffle DSL does not handle back-edge.
2. Emacs bytecode might not be well-formed (like unbalanced unwind calls). I
   guess we should support that.

I guess we are on our own. Let's see if we can support boxing elimination by
hand-rolling a bytecode interpreter ourselves.

By anyway, we still need these structured metadata and I am still hoping for
scaffolding based on code generation.

* Reading List

- [[https://github.com/rocky/elisp-bytecode]]
- [[https://github.com/emacs-mirror/emacs/blob/master/src/bytecode.c][emacs@src/bytecode.c]]
- [[https://github.com/emacs-mirror/emacs/blob/master/lisp/emacs-lisp/bytecomp.el][emacs@lisp/emacs-lisp/bytecomp.el]]

* Bytecode Information

The following are the information this file extracts:

#+begin_src elisp :results discard
  (require 'eieio)

  (defclass ebytecode ()
    ((byte :type number :initarg :byte)
     ;; Extracted by Section 1
     (sname :type symbol)
     (group :type number)
     (length :type number)
     (name :type string)
     (subrp :type boolean)
     (obsolete :type boolean)
     ;; Extracted by Section 2
     (stack-popped :type number)
     (stack-pushed :type number)
     (stack-misc :type boolean)
     ))

  (setq extracted-bytecodes
        (cl-loop for i from 0 to 255 collect (ebytecode :byte i)))
#+end_src

#+RESULTS:

* Section 1: Bytecode List

Emacs provides a =disassemble= function for disassembling bytecode functions.
The following utilizes the internals of =disassemble= to extract bytecode info
(see =disassemble-offset=).

#+begin_src elisp
  (setq subr-list
        '(not add sub eqlsign gtr lss leq geq
              negate plus mult delete-region
              string= string< quo rem))

  (dolist (bytecode extracted-bytecodes)
    ;; Dynamic-scope magic for `disassemble-offset'.
    (defvar bytedecomp-op)
    (defvar bytedecomp-ptr)
    (let ((bytes (string (oref bytecode byte) 0 0))
          (bytedecomp-ptr 0)
          (bytedecomp-op (oref bytecode byte))
          name sname)
      ;; `disassemble-offset' says "Don't call this!", so this might break anytime.
      (disassemble-offset bytes)
      (setq sname (aref byte-code-vector bytedecomp-op))
      (oset bytecode group bytedecomp-op)
      (oset bytecode sname sname)
      (oset bytecode length (1+ bytedecomp-ptr))

      (setq name (symbol-name sname))
      (oset bytecode obsolete (string-suffix-p "-OBSOLETE" name))
      (setq name (string-replace "-OBSOLETE" "*" name))
      (cl-assert (or (string= "nil" name) (string-prefix-p "byte-" name)) t)
      (setq name (if (string-prefix-p "byte-" name) (substring name 5) name))
      (oset bytecode name name)

      (setq sname (intern-soft
                   (if (let ((case-fold-search nil)) (string-match "[0-9N*]$" name))
                       (substring name 0 -1)
                     name)))
      (oset bytecode subrp
            (or (and (memq sname subr-list) t)
                (subrp (symbol-function sname))))))
#+end_src

#+RESULTS:

#+begin_src elisp :tangle no
  ;; Generates bytecode length array for Java
  (let (lengths)
    (dolist (bytecode extracted-bytecodes
                      (apply #'concat (nreverse lengths)))
      (push (format "%d, // #o%03o (%s)\n"
                    (oref bytecode length)
                    (oref bytecode byte)
                    (oref bytecode name))
            lengths)))
#+end_src

#+RESULTS:
#+begin_example
#+end_example

