elisp/scripts/extract-bytecode.el
(require 'eieio)

(defclass ebytecode ()
  ((byte :type number :initarg :byte)
   ;; Extracted by Section 1
   (sname :type symbol)
   (group :type number)
   (length :type number)
   (name :type string)
   (subrp :type boolean)
   (obsolete :type boolean)
   ;; Extracted by Section 2
   (stack-popped :type number)
   (stack-pushed :type number)
   (stack-misc :type boolean)
   ))

(setq extracted-bytecodes
      (cl-loop for i from 0 to 255 collect (ebytecode :byte i)))

(setq subr-list
      '(not add sub eqlsign gtr lss leq geq
            negate plus mult delete-region
            string= string< quo rem))

(dolist (bytecode extracted-bytecodes)
  ;; Dynamic-scope magic for `disassemble-offset'.
  (defvar bytedecomp-op)
  (defvar bytedecomp-ptr)
  (let ((bytes (string (oref bytecode byte) 0 0))
        (bytedecomp-ptr 0)
        (bytedecomp-op (oref bytecode byte))
        name sname)
    ;; `disassemble-offset' says "Don't call this!", so this might break anytime.
    (disassemble-offset bytes)
    (setq sname (aref byte-code-vector bytedecomp-op))
    (oset bytecode group bytedecomp-op)
    (oset bytecode sname sname)
    (oset bytecode length (1+ bytedecomp-ptr))

    (setq name (symbol-name sname))
    (oset bytecode obsolete (string-suffix-p "-OBSOLETE" name))
    (setq name (string-replace "-OBSOLETE" "*" name))
    (cl-assert (or (string= "nil" name) (string-prefix-p "byte-" name)) t)
    (setq name (if (string-prefix-p "byte-" name) (substring name 5) name))
    (oset bytecode name name)

    (setq sname (intern-soft
                 (if (let ((case-fold-search nil)) (string-match "[0-9N*]$" name))
                     (substring name 0 -1)
                   name)))
    (oset bytecode subrp
          (or (and (memq sname subr-list) t)
              (subrp (symbol-function sname))))))
