docs/Bytecode.org
** Extract from subroutine arities

Some of the functions are quite tricky to test. But since most of them are just
wrappers for existing functions, we are going to assert that they match exactly
those subroutines.

#+begin_src elisp
  (dolist (bytecode extracted-bytecodes)
    (when (oref bytecode subrp)
      (let* ((byte (oref bytecode byte))
             (name (oref bytecode name))
             (case-fold-search nil)
             (name (if (string-match "[0-9N*]$" name) (substring name 0 -1) name))
             (sname (intern-soft name))
             (subr (indirect-function sname))
             (arity (and subr (func-arity subr))))
        (cl-assert (or (memq sname subr-list)
                       (subrp subr))
                   t "%s" byte)
        (when (and arity (integerp (cdr arity)))
          (let ((stack-popped (cdr arity))
                (stack-pushed 1)
                (is-misc (or (not (slot-boundp bytecode 'stack-misc)) (oref bytecode stack-misc))))
            (when is-misc
              (oset bytecode stack-popped stack-popped)
              (oset bytecode stack-pushed stack-pushed))
            (cl-assert (= (oref bytecode stack-popped) stack-popped))
            (cl-assert (= (oref bytecode stack-pushed) stack-pushed)))))))
#+end_src

#+RESULTS:

#+begin_src elisp
  (setq other-arities
        '((#o143 insert -1 +1)
          (#o152 indent-to -1 +1)
          (#o300 constant -0 +1)))
  (dolist (arity other-arities)
    (let* ((byte (car arity))
           (name (cadr arity))
           (popped (caddr arity))
           (pushed (cadddr arity))
           (bytecode (nth byte extracted-bytecodes)))
      (cl-assert (string= (oref bytecode name) (symbol-name name)))
      (oset bytecode stack-popped (abs popped))
      (oset bytecode stack-pushed pushed)))

  (setq special-arities
        '(("varref" -0 +1)
          ("varset" -1 +0)
          ("varbind" -1 +0)
          ("unbind" -0 +0)
          ("pophandler" -0 +0)
          ("goto" -0 +0)
          ("goto-if-nil" -1 +0)
          ("goto-if-not-nil" -1 +0)
          ("unwind-protect" -1 +0)
          ("save-excursion" -0 +0)
          ("save-current-buffer" -0 +0)
          ("stack-set" -1 +0)
          ("stack-set2" -1 +0)
          ("switch" -2 +0)
          ("constant" -0 +1)))
  (dolist (bytecode extracted-bytecodes)
    (let ((arity (assoc (oref bytecode name) special-arities)))
      (when arity
        (pcase-let ((`(,_ ,popped ,pushed) arity))
          (unless (slot-boundp bytecode 'stack-popped)
            (oset bytecode stack-popped (abs popped))
            (oset bytecode stack-pushed (abs pushed)))))))
#+end_src

#+RESULTS:

* Finally

#+begin_src elisp
  ;; (setq output 'for-check)
  ;; (setq output 'print-all)
  (setq output 'for-java)
#+end_src

** Manually check against code/documentation

Manually check against [[https://github.com/rocky/elisp-bytecode]]:

#+begin_src elisp
  (when (eq output 'for-check)
    (dolist (bytecode extracted-bytecodes)
      (let ((popped (and (slot-boundp bytecode 'stack-popped) (oref bytecode stack-popped)))
            (pushed (and (slot-boundp bytecode 'stack-pushed) (oref bytecode stack-pushed))))
        (message "#o%03o\t%s\t-%s+%s"
                 (oref bytecode byte)
                 (oref bytecode name)
                 popped pushed))))
#+end_src

** Print all

#+begin_src elisp
  (when (eq output 'print-all)
    (pp extracted-bytecodes))
#+end_src

** Print as a Java array

#+begin_src elisp
  (when (eq output 'for-java)
    (message "byte[] BYTECODE_STACK_EFFECTS = new byte[]{")
    (dolist (bytecode extracted-bytecodes)
      (let ((byte (oref bytecode byte))
            (name (oref bytecode name))
            (popped (and (slot-boundp bytecode 'stack-popped) (oref bytecode stack-popped)))
            (pushed (and (slot-boundp bytecode 'stack-pushed) (oref bytecode stack-pushed))))
        (if (and popped pushed)
            (message "%d, // #o%03o (%s)" (- pushed popped) byte name)
          (message "0x7F, // #o%03o (%s)" byte name))))
    (message "};"))
#+end_src
